---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Analyse des jeux de données data</u></p>

Le lien suivant [ici](../Data) donne accès au dossier où sont stockés tout les csv utilisés pour le projet 

Le lien suivant [ici](https://www.insee.fr/fr/accueil) donne accès au site de l'INSEE où les données ont été collectés

---

# Présentation projet Cliiink2

Dans la continuité du projet Cliiink, nous avons cherché de nouveaux jeux de données afin qu'une analyse socio-démographique puisse etre établie en fonction de chacune des villes de l'agglomération.

Nous avons repris les données de la population par ville, et nous les avons confrontés avec d'autres facteurs sociaux tels que les catégories socio-professionnelles ou le type de logement par ville. 
L'idée étant de comparer ces différents critères sociaux afin de faire ressortir un compte rendu par ville, et de comparer le tout avec les données du premier projet Cliiink. 
Cette conmparaison nous a permit de mettre en valeur la production plus ou moins importante de déchets par ville, en fonction de la catégorie initiallement étudiée.

Les données collectées proviennent majoritairement de l'Institut National de la Statistique et des Etudes Economiques.
À noter que l'INSEE établit ses études par cycle d'année. La dernière étude menée pour établir la démographie de la population des villes de l'agglomération a été faite en 2017. Il s'agit du jeu de données le plus récent, le dernier publié par l'organisme.

Pour des raisons de pratiques, nous modifions l'affichage d'origine des csv en indiquant les colonnes et les lignes qui nous intéresse. Nous pouvons ainsi focaliser notre études en retenant uniquement les données utiles à notre projet.
L'idée est d'afficher le résulat recherché de facon clair. L'INSEE étant un organisme publiant des données de niveau nationale, nous avons isolé du jeu de données uniquement les données qui nous intéresse, soit celles des cinq villes de l'agglomération, et les avons répertoriés dans nos dataframes.

# Analyse des jeux de données data

Ce document analyse les jeux de données que nous sommes allé chercher auprès de l'INSEE et de Data Gouv.

Il y a 7 jeux de données que nous avons utilisé :
    
* CSP_15_24
* CSP_25_54
* CSP_55_plus
* logement_par_catégorie
* etablissements.csv
* naf2008_liste_n1
* naf2008_5_niveaux

### Importation des librairies

In [1]:
import pandas as pd
import json
from sqlalchemy import create_engine
from main import Bin_

### Lecture des fichiers

In [2]:
#societes-immatriculees-2020.csv = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", index_col= 0, sep=';', skiprows=0)
#entreprises_par_sa = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=1 ,encoding="UTF-8", sep=',', skiprows=list(range(0, 2)) + list(range(14, 245)), usecols=[i for i in range(12)])
#entreprises_par_sa_ef = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=16 ,encoding="UTF-8", sep=',', skiprows=list(range(15, 19)) + list(range(28, 245)), usecols=[i for i in range(31)])
#année_2017 = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=30 ,encoding="UTF-8", sep=',', skiprows=list(range(29, 34)) + list(range(37, 245)), usecols=[i for i in range(14)])
#pop_age = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=39 ,encoding="UTF-8", sep=',', skiprows=list(range(38, 41)) + list(range(50, 245)), usecols=[i for i in range(13)])
#emploi_femme = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=145 ,encoding="UTF-8", sep=',', skiprows=list(range(145, 150)) + list(range(161, 245)), usecols=[i for i in range(7)])
#emploi_homme = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=162 ,encoding="UTF-8", sep=',', skiprows=list(range(162, 167)) + list(range(178, 245)), usecols=[i for i in range(7)])
#chomage_sexe = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=179 ,encoding="UTF-8", sep=',', skiprows=list(range(179, 184)) + list(range(190, 245)), usecols=[i for i in range(7)])
#taux_chomage_age = pd.read_csv("/Users/a0000/Desktop/Cliink_Equipe2/Data/villes_data.csv", header=192 ,encoding="UTF-8", sep=',', skiprows=list(range(191, 196)) + list(range(202, 245)), usecols=[i for i in range(13)])
CSP_15_24 = pd.read_csv("../data/villes_data.csv", header=84 ,encoding="UTF-8", sep=',', skiprows=list(range(83, 88)) + list(range(99, 245)), usecols=[i for i in range(6)])
CSP_25_54 = pd.read_csv("../data/villes_data.csv", header=101 ,encoding="UTF-8", sep=',', skiprows=list(range(100, 105)) + list(range(116, 245)), usecols=[i for i in range(6)])
CSP_55_plus = pd.read_csv("../data/villes_data.csv", header=118 ,encoding="UTF-8", sep=',', skiprows=list(range(117, 122)) + list(range(133, 245)), usecols=[i for i in range(6)])
logement_par_catégorie = pd.read_csv("../data/villes_data.csv", header=220 ,encoding="UTF-8", sep=',', skiprows=list(range(219, 224)) + list(range(230, 245)), usecols=[i for i in range(7)])
entreprise_csv = pd.read_csv("../data/etablissements.csv")
code_naf = pd.read_excel("../data/naf2008_liste_n1.xls", skiprows=list(range(0, 2)))
naf_5 = pd.read_excel("../data/naf2008_5_niveaux.xls")
data171819 = pd.read_excel("../data/collecteVerreCACPL/DonnéesVerre2017-2018-2019janvanov.xlsx", skiprows=[0,1], usecols="B:L")
data20 = pd.read_excel("../data/collecteVerreCACPL/VerrePAV2020.xlsx", skiprows=[0,1,2], usecols="B:F")

# On importe le fichier json pour rendre anonyme l'entrée de nos données personnelles lors de la connexion avec la base de données 
fichierConfig = "../data/config.json" 
with open(fichierConfig) as fichier:config = json.load(fichier)["mysql"]

# On indique le nombre de lignes à afficher
pd.options.display.max_rows = 5

/home/simplon/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (18,19,47,54,56,71) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

---

## Retour sur les décisons prises dans la sélection des csv

Le csv "societes-immatriculees-2020.csv" n'a pas été retenu pour le projet car il concerne uniquement les données des entreprises fondées en l'année 2020. 
Or pour que notre étude soit plus pertinente, nous avons jugé judiciable de travailler sur l'ensemble des entreprises de l'agglomération, et non pas uniquement celles crée récemment.

Par ailleurs, les csv "entreprises_par_sa" et "entreprises_par_sa_ef" ont été remplacés par le csv "entreprise_csv", plus complet et précis.

Après analyse de nos besoins, les csv suivants ne se sont pas révélés adéquats pour notre étude :

* année_2017
* pop_age
* emploi_femme
* emploi_homme
* chomage_sexe
* taux_chomage_age

---

# Jeu de données des CSP_15_24

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [3]:
CSP_15_24

,Catégorie,Mandelieu-La-Napoule,Mougins,Le Cannet,Cannes,Theoule-Sur-Mer
0,Agriculteurs exploitants,0,0,0,0,0
1,Artisans. commerçants. chefs entreprise,16,34,26,40,5
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,1000,1049,2128,4519,63
8,Total,1993,1664,3662,7149,115

### Dimension du jeu de données

Le dataframe ci-dessus prend en compte les catégories des classes socio-professionnelles par ville. 

Afin de faire ressortir le nombre exact de catégorie et de les associer au nombre exact de colonne, nous allons supprimer la ligne "Total" qui ne nous est pas utile. De meme, nous ne retiendrons pas la colonne "Catégorie" mais uniquement les cinq colonnes présentant les statistiques des villes de l'agglomération.

In [4]:
print("Le jeu de données recense", CSP_15_24.iloc[:-1].shape[0],"catégories socio-professionnelles pour les 15-25ans des", CSP_15_24.iloc[:,1:].shape[1], "villes de l'agglomération")

Le jeu de données recense 8 catégories socio-professionnelles pour les 15-25ans des 5 villes de l'agglomération

### Valeurs manquantes

Le jeu de données est complet

In [5]:
CSP_15_24.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Theoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [6]:
CSP_15_24.duplicated().sum()

0

---

# Jeu de données des CSP_25_54

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [7]:
CSP_25_54

,Catégorie,Mandelieu-La-Napoule,Mougins,Le Cannet,Cannes,Théoule-Sur-Mer
0,Agriculteurs exploitants,20,3,10,20,0
1,Artisans. commerçants. chefs entreprise,741,927,1225,2089,52
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,597,642,1845,3619,22
8,Total,8073,7941,15085,25189,497

### Dimension du jeu de données

In [8]:
print("Le jeu de données recense", CSP_25_54.iloc[:-1].shape[0],"catégories socio-professionnelles pour les 25-54ans des", CSP_25_54.iloc[:,1:].shape[1], "villes de l'agglomération")

Le jeu de données recense 8 catégories socio-professionnelles pour les 25-54ans des 5 villes de l'agglomération

### Valeurs manquantes

Le jeu de données est complet

In [9]:
CSP_25_54.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Théoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [10]:
CSP_25_54.duplicated().sum()

0

---

# Jeu de données des CSP_55_plus

### Aperçu du fichier

Il contient 6 variables que l'on pourra étudier :

* catégorie
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [11]:
CSP_55_plus

,Catégorie,Mandelieu-La-Napoule,Mougins,le Cannet,Cannes,Théoule-Sur-Mer
0,Agriculteurs exploitants,3,12,5,18,5
1,Artisans. commerçants. chefs entreprise,285,344,532,923,21
...,...,...,...,...,...,...
7,Autres personnes sans activité professionnelle,615,504,1297,2993,64
8,Total,9305,6607,17155,31161,623

### Dimension du jeu de données

In [12]:
class dimension_jeu():
    def __init__(self, df):
        self.df = df

    def _analyse(self, col, edit):
        print("Le jeu de données recense", 
            self.df.iloc[:col].shape[0],
            "catégories pour les", 
            self.df.iloc[:,edit:].shape[1], 
            "villes de l'agglomération")

In [13]:
dimension_jeu(CSP_55_plus)._analyse(-1, 1)

Le jeu de données recense 8 catégories pour les 5 villes de l'agglomération

### Valeurs manquantes

Le jeu de données est complet

In [14]:
CSP_55_plus.isna().sum()

Catégorie               0
Mandelieu-La-Napoule    0
                       ..
Cannes                  0
Théoule-Sur-Mer         0
Length: 6, dtype: int64

### Décompte des doublons

In [15]:
CSP_55_plus.duplicated().sum()

0

---

# Jeu de données des logement_par_catégorie

### Aperçu du fichier

Il contient 7 variables que l'on pourra étudier :

* catégorie
* France
* Mandelieu-La-Napoule
* Mougins
* Le Cannet
* Cannes
* Theoule-Sur-Mer

In [16]:
logement_par_catégorie

,Catégorie,France,Mandelieu-la-Napoule,Mougins,Le Cannet,Cannes,Théoule-sur-Mer
0,Résidences principales,29479746,11339,8403,21276,37735,694
1,Résid. secondaires et log. occasionnels,3464523,8694,1983,4104,31433,2564
2,Logements vacants,2935447,1201,501,940,2096,77
3,Total,35879716,21234,10887,26320,71264,3335

In [89]:
logement_par_catégorie.shape

(4, 7)

### Dimension du jeu de données

In [17]:
dimension_jeu(logement_par_catégorie)._analyse(-1, 2)

Le jeu de données recense 3 catégories pour les 5 villes de l'agglomération

### Valeurs manquantes

Le jeu de données est complet

In [18]:
logement_par_catégorie.isna().sum()

Catégorie          0
France             0
                  ..
Cannes             0
Théoule-sur-Mer    0
Length: 7, dtype: int64

### Décompte des doublons

In [19]:
logement_par_catégorie.duplicated().sum()

0

---

# Jeu de données des entreprise_csv

### Aperçu du fichier

Il contient 76 variables que l'on pourra étudier :

* siren
* nic
* siret
* statutDiffusionEtablissement
* dateCreationEtablissement
* trancheEffectifsEtablissement
* anneeEffectifsEtablissement
* activitePrincipaleRegistreMetiersEtablissement
* dateDernierTraitementEtablissement
* etablissementSiege
* etatAdministratifUniteLegale
* statutDiffusionUniteLegale
* unitePurgeeUniteLegale
* dateCreationUniteLegale
* categorieJuridiqueUniteLegale 
* denominationUniteLegale
* sigleUniteLegale
* denominationUsuelle1UniteLegale
* denominationUsuelle2UniteLegale
* denominationUsuelle3UniteLegale
* sexeUniteLegale
* nomUniteLegale
* nomUsageUniteLegale
* prenom1UniteLegale
* prenom2UniteLegale
* prenom3UniteLegale
* prenom4UniteLegale
* prenomUsuelUniteLegale
* pseudonymeUniteLegale
* activitePrincipaleUniteLegale
* nomenclatureActivitePrincipaleUniteLegale
* identifiantAssociationUniteLegale
* economieSocialeSolidaireUniteLegale
* caractereEmployeurUniteLegale
* trancheEffectifsUniteLegale
* anneeEffectifsUniteLegale
* nicSiegeUniteLegale
* dateDernierTraitementUniteLegale
* categorieEntreprise
* anneeCategorieEntreprise
* complementAdresseEtablissement
* numeroVoieEtablissement
* indiceRepetitionEtablissement
* typeVoieEtablissement
* libelleVoieEtablissement
* codePostalEtablissement
* libelleCommuneEtablissement
* libelleCommuneEtrangerEtablissement
* distributionSpecialeEtablissement
* codeCommuneEtablissement
* codeCedexEtablissement
* libelleCedexEtablissement
* codePaysEtrangerEtablissement
* libellePaysEtrangerEtablissement
* complementAdresse2Etablissement
* numeroVoie2Etablissement
* indiceRepetition2Etablissement
* typeVoie2Etablissement
* libelleVoie2Etablissement
* codePostal2Etablissement
* libelleCommune2Etablissement
* libelleCommuneEtranger2Etablissement
* distributionSpeciale2Etablissement
* codeCommune2Etablissement
* codeCedex2Etablissement
* libelleCedex2Etablissement
* codePaysEtranger2Etablissement
* libellePaysEtranger2Etablissement
* etatAdministratifEtablissement
* enseigne1Etablissement
* enseigne2Etablissement
* enseigne3Etablissement
* denominationUsuelleEtablissement
* activitePrincipaleEtablissement
* nomenclatureActivitePrincipaleEtablissement
* caractereEmployeurEtablissement

In [20]:
pd.options.display.max_rows = 5

In [21]:
entreprise_csv

,siren,nic,siret,statutDiffusionEtablissement,dateCreationEtablissement,trancheEffectifsEtablissement,anneeEffectifsEtablissement,activitePrincipaleRegistreMetiersEtablissement,dateDernierTraitementEtablissement,etablissementSiege,...,codePaysEtranger2Etablissement,libellePaysEtranger2Etablissement,etatAdministratifEtablissement,enseigne1Etablissement,enseigne2Etablissement,enseigne3Etablissement,denominationUsuelleEtablissement,activitePrincipaleEtablissement,nomenclatureActivitePrincipaleEtablissement,caractereEmployeurEtablissement
0,6310965,22,631096500022,O,1982-08-10,NN,NaN,NaN,2019-11-14T14:00:15,True,...,NaN,NaN,A,NaN,NaN,NaN,NaN,68.20A,NAFRev2,N
1,15580079,34,1558007900034,O,2004-06-29,NN,NaN,NaN,2008-01-04T17:54:54,False,...,NaN,NaN,A,NaN,NaN,NaN,NaN,68.20B,NAFRev2,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
54640,998823504,24209,99882350424209,O,2006-01-01,NN,NaN,NaN,2018-10-22T19:02:51,False,...,NaN,NaN,A,ADECCO,NaN,NaN,NaN,78.20Z,NAFRev2,O
54641,998823504,32376,99882350432376,O,2017-12-15,NaN,NaN,NaN,2019-11-14T14:00:15,False,...,NaN,NaN,A,ADECCO,NaN,NaN,ADECCO FRANCE,78.20Z,NAFRev2,O

### Dimension du jeu de données

In [22]:
print("Le jeu de données recense", entreprise_csv.iloc[:].shape[0],"entreprises avec", entreprise_csv.iloc[:].shape[1], "types des données différents")

Le jeu de données recense 54642 entreprises avec 76 types des données différents

### Valeurs manquantes

Commencons par faire ressortir toutes les valeurs manquantes présentes dans le jeu de données des entreprises.

In [23]:
entreprise_csv.isna().sum()

siren                                          0
nic                                            0
                                              ..
nomenclatureActivitePrincipaleEtablissement    0
caractereEmployeurEtablissement                1
Length: 76, dtype: int64

Nous allons maintenant récupérer de ce jeu de données uniquement les variables qui nous intéresse, et que nous allons utiliser pour notre projet.Pour cela nous placons chacune d'entre elles dans la liste ci-dessous.

In [24]:
liste_columns = ["siren", "nic", "denominationUniteLegale", "activitePrincipaleEtablissement",
                "numeroVoieEtablissement", "typeVoieEtablissement", "libelleVoieEtablissement",
                "codePostalEtablissement", "libelleCommuneEtablissement"]

Nous allons faire ressortir le nombre de valeurs manquantes pour chacune des variables de cette liste.

In [25]:
def constat(df):
    print("\nOn constate qu'il manque :")
    [print("\n - "+str(df[i].isna().sum())+" "+i if i in liste_columns else "", end = "") for i in df.columns]

In [26]:
constat(entreprise_csv)

On constate qu'il manque :

 - 0 siren
 - 0 nic
 - 19193 denominationUniteLegale
 - 3936 numeroVoieEtablissement
 - 1329 typeVoieEtablissement
 - 13 libelleVoieEtablissement
 - 0 codePostalEtablissement
 - 0 libelleCommuneEtablissement
 - 0 activitePrincipaleEtablissement

Nous constatons que les variables suivantes ont un jeu de données complet :

* Siren
* Nic
* codePostalEtablissement
* libelleCommuneEtablissement
* activitePrincipaleEtablissement

Alors que les suivantes sont incomplètes :
    
* denominationUniteLegale
* numeroVoieEtablissement
* typeVoieEtablissement
* libelleVoieEtablissement

Ces valeurs manquantes ne nous poseront pas de problème car nous allons utiliser le code Siren pour référencer les entreprises dans la base de données. Or, nous remarquons que la colonne des Siren est complète.

### Décompte des doublons

In [27]:
entreprise_csv.duplicated().sum()

0

---

Afin de vérifier si des anomalies se trouvent parmis les 4 colonnes avec des valeurs manquantes, nous avons affiché le comptage de celles-ci avec un value_counts() :

* denominationUniteLegale
* numeroVoieEtablissement
* typeVoieEtablissement
* libelleVoieEtablissement

Nous remarquons qu'il n'y a pas d'anomalie parmis les valeurs manquantes présentes dans le jeu de données entreprise_csv. Chaque valeurs manquantes a une dénomination qui lui corresponds (il n'y a pas d'espaces vides, par exemple).

In [28]:
entreprise_csv.denominationUniteLegale.value_counts()

COMMUNE DE CANNES    56
COMMUNE LE CANNET    25
                     ..
BLAW                  1
PIERRE OVERALL        1
Name: denominationUniteLegale, Length: 32633, dtype: int64

In [29]:
entreprise_csv.numeroVoieEtablissement.value_counts()

1.0       1330
6.0       1282
          ...
1773.0       1
495.0        1
Name: numeroVoieEtablissement, Length: 1299, dtype: int64

In [30]:
entreprise_csv.typeVoieEtablissement.value_counts()

AV     18037
RUE    15029
       ...
ESP        1
HAM        1
Name: typeVoieEtablissement, Length: 25, dtype: int64

In [31]:
entreprise_csv.libelleVoieEtablissement.value_counts()

D ANTIBES                1403
CARNOT                   1308
                         ...
POINTE DE L 'AIGUILLE       1
ECUREILS                    1
Name: libelleVoieEtablissement, Length: 1550, dtype: int64

---

# Jeu de données des code_naf

### Aperçu du fichier

Il contient 2 variables que l'on pourra étudier :

* Code (nomenclature des secteurs d'activité des entreprises)
* Libellé

In [32]:
code_naf

   Code                                            Libellé
0     A                 Agriculture, sylviculture et pêche
1     B                             Industries extractives
..  ...                                                ...
19    T  Activités des ménages en tant qu'employeurs ; ...
20    U                      Activités extra-territoriales

[21 rows x 2 columns]

### Dimension du jeu de données

In [33]:
print("Le jeu de données recense", code_naf.iloc[:].shape[0],"codes pour", code_naf.iloc[:1].shape[1], "catégorie de nomenclature")

Le jeu de données recense 21 codes pour 2 catégorie de nomenclature

### Valeurs manquantes

Le jeu de données est complet

In [34]:
code_naf.isna().sum()

Code       0
Libellé    0
dtype: int64

### Décompte des doublons

In [35]:
code_naf.duplicated().sum()

0

---

# Jeu de données des naf_5

### Aperçu du fichier

Il contient 5 variables que l'on pourra étudier :

* NIV5
* NIV4
* NIV3
* NIV2
* NIV1

Ces variables représentent le niveaux de référencement des secteurs d'activité des entreprises.

In [36]:
naf_5

       NIV5   NIV4  NIV3  NIV2 NIV1
0    01.11Z   1.11   1.1     1    A
1    01.12Z   1.12   1.1     1    A
..      ...    ...   ...   ...  ...
730  98.20Z  98.20  98.2    98    T
731  99.00Z  99.00  99.0    99    U

[732 rows x 5 columns]

### Dimension du jeu de données

In [37]:
print("Le jeu de données recense", naf_5.iloc[:].shape[0],"références pour", naf_5.iloc[:,:].shape[1], "niveaux de référencement")

Le jeu de données recense 732 références pour 5 niveaux de référencement

### Valeurs manquantes

Le jeu de données est complet

In [38]:
naf_5.isna().sum()

NIV5    0
NIV4    0
NIV3    0
NIV2    0
NIV1    0
dtype: int64

### Décompte des doublons

In [39]:
naf_5.duplicated().sum()

0

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Création des DataFrames</u></p>

La création des DataFrames nous permettra d'établir la connection et le chargement des données directement depuis les tables de notre base de données.

## Création du DataFrame ville

In [40]:
liste_ville_id = [1,2,3,4,5]
liste_ville_nom = ['Cannes', 'Le Cannet', 'Mougins', 'Mandelieu-La-Napoule', 'Theoule-Sur-Mer']
ville = pd.DataFrame({'vi_id': liste_ville_id,
                     'vi_nom': liste_ville_nom})

In [41]:
# Apercu du DataFrame ville
ville

   vi_id                vi_nom
0      1                Cannes
1      2             Le Cannet
2      3               Mougins
3      4  Mandelieu-La-Napoule
4      5       Theoule-Sur-Mer

---

## Création du DataFrame entreprise

In [42]:
# On affiche les adresses en minuscule
entreprise_csv["denominationUniteLegale"] = entreprise_csv["denominationUniteLegale"].str.lower()
# Rectification des code postaux
entreprise_csv["codePostalEtablissement"] = "0" + entreprise_csv["codePostalEtablissement"].astype(str)
# On affiche le nom des villes en minuscule
entreprise_csv["libelleCommuneEtablissement"] = entreprise_csv["libelleCommuneEtablissement"].str.title()
# On affiche les abbreviations des types de voie en minuscule
entreprise_csv["typeVoieEtablissement"] = entreprise_csv["typeVoieEtablissement"].str.lower()
# On affiche les nom des rue en minuscule
entreprise_csv["libelleVoieEtablissement"] = entreprise_csv["libelleVoieEtablissement"].str.lower()

In [43]:
# Création du dictionnaire naf
naf = {}
for i in naf_5.index:
    # Ajout paire clé-valeur
    naf.update({naf_5.iloc[i]['NIV5']: naf_5.loc[i]['NIV1']})

# Création du dictionnaire secteur d'activité
SectAct = {}
for i in code_naf.index:
    # Ajout paire clé-valeur
    SectAct.update({code_naf.iloc[i]['Code']: code_naf.index[i]+1})
    
# Création du dictionnaire des villes
dict_ville = {}
for i in ville.index:
    dict_ville.update({ville.loc[i]['vi_nom']: ville.loc[i]['vi_id']})

In [44]:
# Création du DataFrame entreprise
entreprise = pd.DataFrame(columns =['en_id','en_siren','en_nic', 'en_nom', 'en_sa_id_fk', 'en_adresse', 'en_code_postal', 'en_vi_id_fk'])

for i in entreprise_csv.index:
#for i in range(2000):
    en_id = int(str(entreprise_csv.loc[i]["siren"]) + str(entreprise_csv.loc[i]["nic"]))
    siren = entreprise_csv.iloc[i]['siren']
    nic = entreprise_csv.iloc[i]['nic']
    nom = entreprise_csv.iloc[i]['denominationUniteLegale']
    # Utilisation du dictionaire naf pour répertorier les secteurs d'activité
    a = naf[entreprise_csv.loc[i]["activitePrincipaleEtablissement"]]
    # Utilisation du dictionaire naf SectAct pour réferencer le secteur d'activité
    secteur_activite = SectAct[a]
    
    
    # Ici on test si le numero de voie est non nul/ si oui on le remplace par un str vide
    adresse = (''if pd.isna(entreprise_csv.iloc[i]['numeroVoieEtablissement'])
    # /sinon on le transforme en int pour supprimer les chiffres apres la virgule puis en str
 else str(int(entreprise_csv.iloc[i]['numeroVoieEtablissement'])))+" "+str(entreprise_csv.loc[i]["typeVoieEtablissement"])+" "+str(entreprise_csv.loc[i]["libelleVoieEtablissement"])
    
    
    code_postal = entreprise_csv.loc[i]["codePostalEtablissement"]
    en_ville = dict_ville[entreprise_csv.loc[i]["libelleCommuneEtablissement"]]
    
    df = pd.DataFrame({'en_id': en_id,
                           'en_siren': siren,
                           'en_nic': nic,
                           'en_nom': nom,
                           'en_sa_id_fk': secteur_activite,
                           'en_adresse': adresse,
                           'en_code_postal':code_postal,
                           'en_vi_id_fk':en_ville}, index = [0])
    entreprise = entreprise.append(df, ignore_index=True)

In [45]:
# Apercu du DataFrame entreprise
entreprise

,en_id,en_siren,en_nic,en_nom,en_sa_id_fk,en_adresse,en_code_postal,en_vi_id_fk
0,631096522,6310965,22,NaN,12,av gaston de fontmichel,06210,4
1,1558007934,15580079,34,societe immobiliere walter sperger,12,2 bd leader,06150,1
...,...,...,...,...,...,...,...,...
54640,99882350424209,998823504,24209,adecco france,14,3 rue du bosquet,06150,1
54641,99882350432376,998823504,32376,adecco france,14,226 av saint exupery,06210,4

---

## Création du DataFrame secteur_activite

In [46]:
# On utilise le fichier code naf pour le DataFrame secteur activité
secteur_activite = pd.DataFrame(code_naf, columns = ["sa_id", "Libellé"])
secteur_activite["sa_id"] = secteur_activite.index + 1
secteur_activite.rename(columns={"Libellé": "sa_nom"},inplace=True)

In [47]:
# Apercu du DataFrame sesecteur_activite
secteur_activite

    sa_id                                             sa_nom
0       1                 Agriculture, sylviculture et pêche
1       2                             Industries extractives
..    ...                                                ...
19     20  Activités des ménages en tant qu'employeurs ; ...
20     21                      Activités extra-territoriales

[21 rows x 2 columns]

---

## Création du DataFrame categorie_socio_pro

In [48]:
# On utilise le fichier CSP_15_24 pour le DataFrame categorie_socio_pro
categorie_socio_pro = pd.DataFrame(CSP_15_24, columns =["csp_id","Catégorie"])
categorie_socio_pro["csp_id"] = categorie_socio_pro.index + 1
categorie_socio_pro.rename(columns = {"Catégorie": "csp_nom"},inplace=True)

In [49]:
# Apercu du DataFrame categorie_socio_pro
categorie_socio_pro

    csp_id                                         csp_nom
0        1                        Agriculteurs exploitants
1        2         Artisans. commerçants. chefs entreprise
..     ...                                             ...
7        8  Autres personnes sans activité professionnelle
8        9                                           Total

[9 rows x 2 columns]

---

## Création du DataFrame age

In [50]:
liste_ag_id = [1,2,3]
liste_ag_nom = ["15 a 24", "25 a 54","55 et plus"]
age = pd.DataFrame({'ag_id': liste_ag_id,
                     'ag_tranche_age': liste_ag_nom})

In [51]:
# Apercu du DataFrame age
age

   ag_id ag_tranche_age
0      1        15 a 24
1      2        25 a 54
2      3     55 et plus

---

## Création du DataFrame age du DataFrame population

In [52]:
# On rectifie l'ortographe de la colonne Theoule-Sur-Mer
CSP_25_54.rename(columns={"Théoule-Sur-Mer": "Theoule-Sur-Mer"}, inplace = True)
CSP_55_plus.rename(columns={"Théoule-Sur-Mer": "Theoule-Sur-Mer"}, inplace = True)
# On rectifie l'ortographe de la colonne Le Cannet
CSP_55_plus.rename(columns={"le Cannet": "Le Cannet"}, inplace = True)

In [53]:
# Création d'une fonction add_df qui renvoie un DataFrame adapté pour la table population
def add_df(df):
    # Création d'un DataFrame adapté pour la table population
    dataf = pd.DataFrame(columns = ["po_id","po_source", "po_annee", "po_nbre_pop", "po_csp_id_fk", "po_ag_id_fk", "po_vi_id_fk"])
    # Dans une premiere boucle on itère sur le nbre de ligne qui correcpond à csp
    for i in df.index:
        # Dans une deuxieme boucle imbriquer on itère sur le nbre de colonne qui correspond aux villes
        for j in df.columns[1:]:
            nbre = df.iloc[i][j]
            ville1 = dict_ville[j]
            csp = i + 1
            DF = pd.DataFrame({'po_id': i,
                           'po_source': "Insee, Recensement de la population (RP), exploitation complémentaire - 2017",
                           'po_annee': 2017,
                           'po_nbre_pop': nbre,
                           'po_csp_id_fk': csp,
                           'po_vi_id_fk': ville1}, index = [0])
            dataf = dataf.append(DF, ignore_index=True)
    return dataf

In [54]:
# On utilise la fonction add_df pour creer des dataframe en fonction de la tranche d'age
population15_24 = add_df(CSP_15_24)
population25_54 = add_df(CSP_25_54)
population55_plus = add_df(CSP_55_plus)

# On assigne la clé entrangère de la table age
password = Bin_(config["password"])._UserP()
population15_24['po_ag_id_fk']=1
population25_54['po_ag_id_fk']=2
population55_plus['po_ag_id_fk']=3

# On réunis les 3 DataFrames dans le DataFrame poplulation
population = pd.concat([population15_24,population25_54,population55_plus])
population.reset_index(inplace = True)
population['po_id'] = population.index + 1
population.drop(columns=['index'], inplace=True)

# On modifie le type de po_année
# population['po_annee']= pd.to_datetime(population['po_annee'], format="%Y")

In [55]:
# Apercu du DataFrame population
population

,po_id,po_source,po_annee,po_nbre_pop,po_csp_id_fk,po_ag_id_fk,po_vi_id_fk
0,1,"Insee, Recensement de la population (RP), expl...",2017,0,1,1,4
1,2,"Insee, Recensement de la population (RP), expl...",2017,0,1,1,3
...,...,...,...,...,...,...,...
133,134,"Insee, Recensement de la population (RP), expl...",2017,31161,9,3,1
134,135,"Insee, Recensement de la population (RP), expl...",2017,623,9,3,5

---

## Création du DataFrame categorie_logement

In [56]:
# On utilise le fichier logement_par_catégorie pour le DataFrame categorie_logement
categorie_logement = pd.DataFrame(logement_par_catégorie, columns =["cl_id","Catégorie"])
categorie_logement["cl_id"] = categorie_logement.index + 1
categorie_logement.rename(columns = {"Catégorie": "cl_nom"},inplace=True)

In [57]:
# Apercu du DataFrame categorie_logement
categorie_logement

   cl_id                                   cl_nom
0      1                   Résidences principales
1      2  Résid. secondaires et log. occasionnels
2      3                        Logements vacants
3      4                                    Total

---

## Création du DataFrame logement

In [58]:
# On rectifie l'ortographe de la colonne Mandelieu-la-Napoule
logement_par_catégorie.rename(columns={"Mandelieu-la-Napoule": "Mandelieu-La-Napoule"}, inplace = True)
# On rectifie l'ortographe de la colonne Theoule-Sur-Mer
logement_par_catégorie.rename(columns={"Théoule-sur-Mer": "Theoule-Sur-Mer"}, inplace = True)

In [59]:
# Création du DataFrame logement
logement = pd.DataFrame(columns = ["lo_id","lo_nbre","lo_vi_id_fk","lo_cl_id_fk"])

for i in logement_par_catégorie.index:
    for j in logement_par_catégorie.columns[2:]:
        nbre_lg = logement_par_catégorie.iloc[i][j]
        ville_lg = dict_ville[j]
        type_lg = i +1
        df_lg = pd.DataFrame({'lo_nbre': nbre_lg,
                           'lo_vi_id_fk': ville_lg,
                           'lo_cl_id_fk': type_lg}, index = [0])
        logement = logement.append(df_lg, ignore_index=True)
        
logement['lo_id'] = logement.index + 1

In [60]:
# Apercu du DataFrame logement
logement

    lo_id lo_nbre lo_vi_id_fk lo_cl_id_fk
0       1   11339           4           1
1       2    8403           3           1
..    ...     ...         ...         ...
18     19   71264           1           4
19     20    3335           5           4

[20 rows x 4 columns]

### Exemple de boucle :

In [61]:
for i in logement_par_catégorie.index:
    for j in logement_par_catégorie.columns[2:]:
        print("le chiffre est :   ", logement_par_catégorie.iloc[i][j],";\tla logement_par_catégorie est :", i,";\t la ville est :", str(j))

le chiffre est :    11339 ;	la logement_par_catégorie est : 0 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    8403 ;	la logement_par_catégorie est : 0 ;	 la ville est : Mougins
le chiffre est :    21276 ;	la logement_par_catégorie est : 0 ;	 la ville est : Le Cannet
le chiffre est :    37735 ;	la logement_par_catégorie est : 0 ;	 la ville est : Cannes
le chiffre est :    694 ;	la logement_par_catégorie est : 0 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    8694 ;	la logement_par_catégorie est : 1 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    1983 ;	la logement_par_catégorie est : 1 ;	 la ville est : Mougins
le chiffre est :    4104 ;	la logement_par_catégorie est : 1 ;	 la ville est : Le Cannet
le chiffre est :    31433 ;	la logement_par_catégorie est : 1 ;	 la ville est : Cannes
le chiffre est :    2564 ;	la logement_par_catégorie est : 1 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    1201 ;	la logement_par_catégorie est : 2 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    501 ;	la logement_par_catégorie est : 2 ;	 la ville est : Mougins
le chiffre est :    940 ;	la logement_par_catégorie est : 2 ;	 la ville est : Le Cannet
le chiffre est :    2096 ;	la logement_par_catégorie est : 2 ;	 la ville est : Cannes
le chiffre est :    77 ;	la logement_par_catégorie est : 2 ;	 la ville est : Theoule-Sur-Mer
le chiffre est :    21234 ;	la logement_par_catégorie est : 3 ;	 la ville est : Mandelieu-La-Napoule
le chiffre est :    10887 ;	la logement_par_catégorie est : 3 ;	 la ville est : Mougins
le chiffre est :    26320 ;	la logement_par_catégorie est : 3 ;	 la ville est : Le Cannet
le chiffre est :    71264 ;	la logement_par_catégorie est : 3 ;	 la ville est : Cannes
le chiffre est :    3335 ;	la logement_par_catégorie est : 3 ;	 la ville est : Theoule-Sur-Mer

## Création du DataFrame collecteur

In [62]:
# Création des dictionnaire dictVilles et dictVillesMajuscules
dictVilles = { "CAN": "Cannes", "CNT": "Le Cannet", "MAN": "Mandelieu-La-Napoule", "MOU": "Mougins", "THE": "Theoule-Sur-Mer"}
dictVillesMajuscules = { "CANNES": "Cannes", "LE CANNET": "Le Cannet", "MANDELIEU-LA-NAPOULE": "Mandelieu-La-Napoule", "MOUGINS": "Mougins", "THÉOULE-SUR-MER": "Theoule-Sur-Mer"}

# Suppréssion des doublons
data171819.drop_duplicates(inplace=True)

# Création du DataFrame collecte171819
collecte1 = pd.DataFrame(columns = ["id","ville","date","poids"])
for i in data171819.index:
    col1_vi = dict_ville[dictVillesMajuscules[data171819.loc[i, "Ville"]]]
    col1_da = data171819.loc[i, "date "]
    col1_pi = data171819.loc[i, "Poids Kg"]
    df_coll1 = pd.DataFrame({'ville': col1_vi,
                             'date': col1_da,
                             'poids': col1_pi}, index = [0])
    collecte1 = collecte1.append(df_coll1, ignore_index=True)
collecte1['id'] = collecte1.index + 1
collecte1

          id ville       date poids
0          1     2 2017-01-05   500
1          2     2 2017-01-05   420
...      ...   ...        ...   ...
24757  24758     1 2019-11-22   230
24758  24759     1 2019-11-22   280

[24759 rows x 4 columns]

In [63]:
# Suppréssion des doublons
data20.drop_duplicates(subset=data20.columns[1:], inplace=True)
data20.reset_index(inplace=True)

# Création du DataFrame collecte2020
collecte2 = pd.DataFrame(columns = ["id","ville","date","poids"])
for i in data20.index:  
    data20.loc[i, "ville"] = dictVilles[data20.loc[i, "Lieu de Collecte"][5:8]]
    col2_vi = dict_ville[data20.loc[i, "ville"]] 
    col2_da = data20.loc[i, "Date de réalisation"]
    col2_pi = data20.loc[i, "Poids"]
    df_coll2 = pd.DataFrame({'ville': col2_vi,
                             'date': col2_da,
                             'poids': col2_pi}, index = [0])
    collecte2 = collecte2.append(df_coll2, ignore_index=True)
collecte2.poids = (collecte2.poids * 1000).astype(int)
collecte2['id'] = collecte2.index + 1
collecte2

        id ville       date  poids
0        1     2 2020-01-02    436
1        2     2 2020-01-02    436
...    ...   ...        ...    ...
5384  5385     1 2020-09-30    180
5385  5386     1 2020-09-30    180

[5386 rows x 4 columns]

In [64]:
# On réunit les 2 DataFrames dans le DataFrame collecteur
collecte = pd.concat([collecte1, collecte2])
collecte.reset_index(inplace = True)
collecte['id'] = collecte.index + 1
collecte.drop(columns=['index'], inplace=True)
collecte

          id ville       date poids
0          1     2 2017-01-05   500
1          2     2 2017-01-05   420
...      ...   ...        ...   ...
30143  30144     1 2020-09-30   180
30144  30145     1 2020-09-30   180

[30145 rows x 4 columns]

### Analyse du jeu de données

In [65]:
print("Le jeu de donnees compte", entreprise.shape[0], "entreprises localisées dans les ", ville.shape[0], "villes de l'agglomération.")

Le jeu de donnees compte 54642 entreprises localisées dans les  5 villes de l'agglomération.

### Décompte des secteurs d'activités

In [66]:
en_vc = entreprise['en_nom'].value_counts()
en_vc.head(5)

commune de cannes             56
commune le cannet             25
elres                         21
distribution casino france    17
la poste                      17
Name: en_nom, dtype: int64

### Générer le résumé statistique du dataframe

In [67]:
population.describe(include='all')

,po_id,po_source,po_annee,po_nbre_pop,po_csp_id_fk,po_ag_id_fk,po_vi_id_fk
count,135.0,135,135.0,135.0,135.0,135.0,135.0
unique,NaN,1,1.0,110.0,9.0,NaN,5.0
...,...,...,...,...,...,...,...
75%,101.5,NaN,NaN,NaN,NaN,3.0,NaN
max,135.0,NaN,NaN,NaN,NaN,3.0,NaN

In [68]:
entreprise.describe(include='all')

,en_id,en_siren,en_nic,en_nom,en_sa_id_fk,en_adresse,en_code_postal,en_vi_id_fk
count,54642,54642,54642,35449,54642,54642,54642,54642
unique,54642,52305,1001,32633,20,13795,6,5
top,38874639863,210600292,10,commune de cannes,12,29 bd de la ferrage,06400,1
freq,1,56,3522,56,19458,352,24233,29694

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Data Cleaning DataFrames</u></p>

L'Institut national de la statistique et des études économiques est une direction générale du ministère de l'Économie et des Finances. Il a pour mission de collecter, analyser et diffuser des informations sur l'économie et la société française sur l'ensemble de son territoire.

L'INSEE est ainsi un organisme qui publie des statistiques officielles. Les données qui en ressortent sont dons déjà fiables, néttoyées. Les csv ne devraient donc pas nécessairement avoir besoin d'etre nottoyés.

Pour pour s'assurer de l'intégrité de nos données, nous allons tout de meme y mener quelques vérifications.

# Décompte des valeurs manquantes

### Dataframe Ville

In [69]:
ville.isna().sum()

vi_id     0
vi_nom    0
dtype: int64

In [70]:
ville.duplicated().sum()

0

---

### Dataframe secteur_activite

In [71]:
secteur_activite.isna().sum()

sa_id     0
sa_nom    0
dtype: int64

In [72]:
secteur_activite.duplicated().sum()

0

---

### Dataframe categorie_socio_pro

In [73]:
categorie_socio_pro.isna().sum()

csp_id     0
csp_nom    0
dtype: int64

In [74]:
categorie_socio_pro.duplicated().sum()

0

---

### Dataframe age

In [75]:
age.isna().sum()

ag_id             0
ag_tranche_age    0
dtype: int64

In [76]:
age.duplicated().sum()

0

---

### Dataframe categorie_logement

In [77]:
categorie_logement.isna().sum()

cl_id     0
cl_nom    0
dtype: int64

In [78]:
categorie_logement.duplicated().sum()

0

---

### Dataframe logement

In [79]:
logement.isna().sum()

lo_id          0
lo_nbre        0
lo_vi_id_fk    0
lo_cl_id_fk    0
dtype: int64

In [80]:
logement.duplicated().sum()

0

---

### Dataframe population

In [81]:
population.isna().sum()

po_id          0
po_source      0
              ..
po_ag_id_fk    0
po_vi_id_fk    0
Length: 7, dtype: int64

In [82]:
population.duplicated().sum()

0

---

### Dataframe entreprise

In [83]:
entreprise.isna().sum()

en_id             0
en_siren          0
                 ..
en_code_postal    0
en_vi_id_fk       0
Length: 8, dtype: int64

In [84]:
entreprise.duplicated().sum()

0

---

Les jeu de données est complet. Il n'y a pas besoin de droper de doublons par exemple.

Nous pouvons procéder à l'intégration des données dans la base de données.

---

# <p style="font-family: serif; font-size:2.2em; text-align: center;"><u>Connexion et insertion des données dans la BDD</u></p>

## Connexion à la base de données sur Workbench

In [85]:
engine = create_engine('mysql+' + config["connector"] + '://' + config["user"] + ":" + password + "@" + config["host"] + ":" + config["port"] + "/" + config["bdd"], echo=True)

In [86]:
ville.to_sql('ville', con=engine, if_exists='append', index=False)

2021-01-18 15:48:18,759 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2021-01-18 15:48:18,760 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,767 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2021-01-18 15:48:18,768 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,772 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2021-01-18 15:48:18,773 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,776 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2021-01-18 15:48:18,776 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,780 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2021-01-18 15:48:18,782 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,783 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2021-01-18 15:48:18,786 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,788 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2021-01-18 15:48:18,789 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,793 INFO sqlalchemy.engine.base.Engine DESCRIBE `ville`
2021-01-18 15:48:18,794 INFO sqlalchemy.engine.base.Engine {}
2021-01-18 15:48:18,799 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2021-01-18 15:48:18,800 INFO sqlalchemy.engine.base.Engine INSERT INTO ville (vi_id, vi_nom) VALUES (%(vi_id)s, %(vi_nom)s)
2021-01-18 15:48:18,801 INFO sqlalchemy.engine.base.Engine ({'vi_id': 1, 'vi_nom': 'Cannes'}, {'vi_id': 2, 'vi_nom': 'Le Cannet'}, {'vi_id': 3, 'vi_nom': 'Mougins'}, {'vi_id': 4, 'vi_nom': 'Mandelieu-La-Napoule'}, {'vi_id': 5, 'vi_nom': 'Theoule-Sur-Mer'})
2021-01-18 15:48:18,831 INFO sqlalchemy.engine.base.Engine ROLLBACK

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'PRIMARY'")
[SQL: INSERT INTO ville (vi_id, vi_nom) VALUES (%(vi_id)s, %(vi_nom)s)]
[parameters: ({'vi_id': 1, 'vi_nom': 'Cannes'}, {'vi_id': 2, 'vi_nom': 'Le Cannet'}, {'vi_id': 3, 'vi_nom': 'Mougins'}, {'vi_id': 4, 'vi_nom': 'Mandelieu-La-Napoule'}, {'vi_id': 5, 'vi_nom': 'Theoule-Sur-Mer'})]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [ ]:
secteur_activite.to_sql('secteur_activite', con=engine, if_exists='append', index=False)

In [ ]:
categorie_socio_pro.to_sql('categorie_socio_pro', con=engine, if_exists='append', index=False)

In [ ]:
age.to_sql('age', con=engine, if_exists='append', index=False)

In [ ]:
categorie_logement.to_sql('categorie_logement', con=engine, if_exists='append', index=False)

In [ ]:
logement.to_sql('logement', con=engine, if_exists='append', index=False)

In [ ]:
population.to_sql('population', con=engine, if_exists='append', index=False)

In [ ]:
entreprise.to_sql('entreprise', con=engine, if_exists='append', index=False)

In [ ]:
collecte.to_sql('collecte', con=engine, if_exists='append', index=False)

---